docs: upgrade Procurea README
